Revit 2015 API
Units.IsValidDecimalSymbolAndGrouping Method
 Checks if a combination of decimal symbol and digit grouping settings is allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015.  Any combination of these values is now permitted, so this method will always return true.")]
public static bool IsValidDecimalSymbolAndGrouping(
	DecimalSymbol decimalSymbol,
	DigitGroupingSymbol digitGroupingSymbol,
	DigitGroupingAmount digitGroupingAmount
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015.  Any combination of these values is now permitted, so this method will always return true.")> _
Public Shared Function IsValidDecimalSymbolAndGrouping ( _
	decimalSymbol As DecimalSymbol, _
	digitGroupingSymbol As DigitGroupingSymbol, _
	digitGroupingAmount As DigitGroupingAmount _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015.  Any combination of these values is now permitted, so this method will always return true.")]
public:
static bool IsValidDecimalSymbolAndGrouping(
	DecimalSymbol decimalSymbol,
	DigitGroupingSymbol digitGroupingSymbol,
	DigitGroupingAmount digitGroupingAmount
)
Parameters
decimalSymbol
Type: Autodesk.Revit.DB.DecimalSymbol
 The decimal symbol.
digitGroupingSymbol
Type: Autodesk.Revit.DB.DigitGroupingSymbol
 The digit grouping symbol.
digitGroupingAmount
Type: Autodesk.Revit.DB.DigitGroupingAmount
 The number of digits in each group.
Return Value
 True if the combination is permitted. Always returns true.
Remarks
 All combinations are now permitted, so this method always returns true.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Units Class
Autodesk.Revit.DB Namespace